In [9]:
import pandas as pd

### task1

In [11]:
authors = pd.DataFrame({'author_id':[1,2,3], 'author_name':['Тургенев','Чехов','Островский']})

In [12]:
print(authors)

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [13]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [14]:
book = pd.DataFrame({'author_id':[1,1,1,2,2,3,3], 
                     'book_title':['Отцы и Дети','Рудин','Дворянское гнездо',
                                   'Толстый и тонкий','Дама с собачкой',
                                   'Гроза', 'Таланты и поклонники'],
                    'price':[450, 300, 350, 500, 450, 370, 290]})

In [15]:
book

   author_id            book_title  price
0          1           Отцы и Дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### task2

In [16]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')

In [18]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и Дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [19]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')

In [20]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и Дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [21]:
authors_price = pd.merge(authors, book, on='author_id', how='right')

In [22]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и Дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### task3

In [23]:
top5 = authors_price.nlargest(5, 'price')

In [24]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и Дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### task4

In [53]:
authors_stat = authors_price.groupby('author_name').agg({'price':[('min_price', 'min'), ('max_price', 'max'),('mean_price', 'mean')]})

In [54]:
authors_stat

                price
            min_price max_price  mean_price
author_name
Островский        290       370  330.000000
Тургенев          300       450  366.666667
Чехов             450       500  475.000000